#### OpenTofu Format: success
#### OpenTofu Init: success
#### OpenTofu Validate: success
#### OpenTofu Plan: success

<details><summary>Show Plan</summary>

```terraform
module.storage.data.archive_file.issuer_stub: Reading...
module.storage.data.archive_file.bitstring_updater_stub: Reading...
module.storage.data.archive_file.revocation_stub: Reading...
module.storage.data.archive_file.free_stub: Reading...
module.storage.data.archive_file.bitstring_updater_stub: Read complete after 0s [id=d8b12a9724c5ba1456529b920097d3a70e57ff2e]
module.storage.data.archive_file.issuer_stub: Read complete after 0s [id=d8b12a9724c5ba1456529b920097d3a70e57ff2e]
module.storage.data.archive_file.free_stub: Read complete after 0s [id=d8b12a9724c5ba1456529b920097d3a70e57ff2e]
module.storage.data.archive_file.revocation_stub: Read complete after 0s [id=d8b12a9724c5ba1456529b920097d3a70e57ff2e]
module.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::043189681060:oidc-provider/token.actions.githubusercontent.com]
module.lambda_roles.aws_iam_role.free_lambda: Refreshing state... [id=zeroverify-free-lambda]
module.secrets.aws_secretsmanager_secret.hmac_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/hmac-key-gV2ThR]
module.lambda_roles.aws_iam_role.bitstring_updater_lambda: Refreshing state... [id=zeroverify-bitstring-updater-lambda]
module.dynamodb.data.aws_region.current: Reading...
module.secrets.aws_secretsmanager_secret.baby_jubjub_private_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/baby-jubjub-private-key-DTTklP]
module.lambda_roles.aws_iam_role.issuer_lambda: Refreshing state... [id=zeroverify-issuer-lambda]
module.storage.aws_s3_bucket.deployment_artifacts: Refreshing state... [id=zeroverify-deployment-artifacts]
module.dynamodb.aws_dynamodb_table.bit_indices: Refreshing state... [id=zeroverify-bit-indices]
module.dynamodb.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dynamodb.aws_dynamodb_table.credentials: Refreshing state... [id=zeroverify-credentials]
module.lambda_roles.aws_iam_role.revocation_lambda: Refreshing state... [id=zeroverify-revocation-lambda]
module.github_oidc.aws_iam_role.infrastructure: Refreshing state... [id=ZeroVerifyGitHubActionsInfra]
module.github_oidc.aws_iam_role.lambda_deployment: Refreshing state... [id=ZeroVerifyGitHubActionsLambdaDeployment]
module.secrets.aws_secretsmanager_secret_version.hmac_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/hmac-key-gV2ThR|terraform-20260318204547976400000003]
module.secrets.aws_secretsmanager_secret_version.baby_jubjub_private_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:043189681060:secret:zeroverify/baby-jubjub-private-key-DTTklP|terraform-20260318204548046200000004]
module.github_oidc.aws_iam_role_policy_attachment.infrastructure_admin: Refreshing state... [id=ZeroVerifyGitHubActionsInfra-20260318183740036000000001]
module.storage.aws_s3_bucket_public_access_block.deployment_artifacts: Refreshing state... [id=zeroverify-deployment-artifacts]
module.storage.aws_s3_bucket_lifecycle_configuration.deployment_artifacts: Refreshing state... [id=zeroverify-deployment-artifacts]
module.storage.aws_s3_object.bitstring_updater_stub: Refreshing state... [id=lambda/bitstring-updater-lambda.zip]
module.storage.aws_s3_object.free_stub: Refreshing state... [id=lambda/free-lambda.zip]
module.github_oidc.aws_iam_policy.lambda_deployment: Refreshing state... [id=arn:aws:iam::043189681060:policy/GitHubActionsLambdaDeployment]
module.storage.aws_s3_object.issuer_stub: Refreshing state... [id=lambda/issuer-lambda.zip]
module.storage.aws_s3_object.revocation_stub: Refreshing state... [id=lambda/revocation-lambda.zip]
module.github_oidc.aws_iam_role_policy_attachment.lambda_deployment_policy: Refreshing state... [id=ZeroVerifyGitHubActionsLambdaDeployment-20260318183740123100000002]
module.dynamodb.aws_dynamodb_table_item.bit_indices_metadata: Refreshing state... [id=zeroverify-bit-indices|bit_index|-1]
module.lambda_roles.aws_iam_role_policy.bitstring_updater_lambda: Refreshing state... [id=zeroverify-bitstring-updater-lambda:bitstring-updater-lambda-policy]
module.lambda_roles.aws_iam_role_policy.revocation_lambda: Refreshing state... [id=zeroverify-revocation-lambda:revocation-lambda-policy]
module.lambda_roles.aws_iam_role_policy.free_lambda: Refreshing state... [id=zeroverify-free-lambda:free-lambda-policy]
module.lambda_roles.aws_iam_role_policy.issuer_lambda: Refreshing state... [id=zeroverify-issuer-lambda:issuer-lambda-policy]
module.lambda.aws_lambda_function.free: Refreshing state... [id=zeroverify-free]
module.lambda.aws_lambda_function.bitstring_updater: Refreshing state... [id=zeroverify-bitstring-updater]
module.lambda.aws_lambda_function.revocation: Refreshing state... [id=zeroverify-revocation]
module.lambda.aws_lambda_function.issuer: Refreshing state... [id=zeroverify-issuer]
module.lambda.aws_lambda_event_source_mapping.bitstring_updater: Refreshing state... [id=57578001-e7a4-4b40-bd5e-f3dea027238f]
module.lambda.aws_lambda_event_source_mapping.free: Refreshing state... [id=5ce7a98e-7e65-4cc2-b5f1-423bb2d797fb]
module.dns.aws_route53_zone.api: Refreshing state... [id=Z0900771415X3G2Q3S52]
module.dns.cloudflare_dns_record.github_pages_challenge: Refreshing state... [id=ee412ae21494d89eca2a8b71b5c3b54c]
module.dns.cloudflare_dns_record.www: Refreshing state... [id=5f96eabb43b0feb43d6188643cc29c45]
module.dns.cloudflare_dns_record.api_ns[0]: Refreshing state... [id=7a545119d66f2e5cb8a84c42c85bc19f]
module.dns.cloudflare_dns_record.api_ns[3]: Refreshing state... [id=c4083716fa9e669cccb1db53233cfd31]
module.dns.cloudflare_dns_record.api_ns[2]: Refreshing state... [id=8f83c7b598d137107bd3327d73579429]
module.dns.cloudflare_dns_record.api_ns[1]: Refreshing state... [id=c9774e3ef90651e1c6c23bbbece154ac]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.api_gateway.aws_apigatewayv2_api.api["us-east-1"] will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "zeroverify-api-us-east-1"
      + protocol_type                = "HTTP"
      + region                       = "us-east-1"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                     = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
    }

  # module.api_gateway.aws_apigatewayv2_api.api["us-west-2"] will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "zeroverify-api-us-west-2"
      + protocol_type                = "HTTP"
      + region                       = "us-west-2"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                     = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration["us-east-1/issuer"] will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration["us-east-1/revocation"] will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration["us-west-2/issuer"] will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-west-2"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration["us-west-2/revocation"] will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-west-2"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.api_routes["us-east-1/POST /api/v1/credentials/issue"] will be created
  + resource "aws_apigatewayv2_route" "api_routes" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /api/v1/credentials/issue"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.api_routes["us-east-1/POST /api/v1/credentials/revoke"] will be created
  + resource "aws_apigatewayv2_route" "api_routes" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /api/v1/credentials/revoke"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.api_routes["us-west-2/POST /api/v1/credentials/issue"] will be created
  + resource "aws_apigatewayv2_route" "api_routes" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-west-2"
      + route_key          = "POST /api/v1/credentials/issue"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.api_routes["us-west-2/POST /api/v1/credentials/revoke"] will be created
  + resource "aws_apigatewayv2_route" "api_routes" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-west-2"
      + route_key          = "POST /api/v1/credentials/revoke"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default["us-east-1"] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-east-1"
      + tags          = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all      = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod         = "$context.httpMethod"
                  + integrationLatency = "$context.integration.latency"
                  + ip                 = "$context.identity.sourceIp"
                  + protocol           = "$context.protocol"
                  + requestId          = "$context.requestId"
                  + requestTime        = "$context.requestTime"
                  + resourcePath       = "$context.resourcePath"
                  + responseLength     = "$context.responseLength"
                  + status             = "$context.status"
                }
            )
        }
    }

  # module.api_gateway.aws_apigatewayv2_stage.default["us-west-2"] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-west-2"
      + tags          = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all      = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod         = "$context.httpMethod"
                  + integrationLatency = "$context.integration.latency"
                  + ip                 = "$context.identity.sourceIp"
                  + protocol           = "$context.protocol"
                  + requestId          = "$context.requestId"
                  + requestTime        = "$context.requestTime"
                  + resourcePath       = "$context.resourcePath"
                  + responseLength     = "$context.responseLength"
                  + status             = "$context.status"
                }
            )
        }
    }

  # module.api_gateway.aws_cloudwatch_log_group.api_gateway["us-east-1"] will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/apigateway/zeroverify-api-us-east-1"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                    = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
    }

  # module.api_gateway.aws_cloudwatch_log_group.api_gateway["us-west-2"] will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/apigateway/zeroverify-api-us-west-2"
      + name_prefix                 = (known after apply)
      + region                      = "us-west-2"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                    = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
    }

  # module.api_gateway.aws_lambda_permission.api_gateway_invoke["us-east-1/issuer"] will be created
  + resource "aws_lambda_permission" "api_gateway_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-us-east-1"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.api_gateway_invoke["us-east-1/revocation"] will be created
  + resource "aws_lambda_permission" "api_gateway_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-us-east-1"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.api_gateway_invoke["us-west-2/issuer"] will be created
  + resource "aws_lambda_permission" "api_gateway_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-west-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-us-west-2"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.api_gateway_invoke["us-west-2/revocation"] will be created
  + resource "aws_lambda_permission" "api_gateway_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-west-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-us-west-2"
      + statement_id_prefix = (known after apply)
    }

  # module.dns.data.cloudflare_zone.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zone" "main" {
      + account               = (known after apply)
      + activated_on          = (known after apply)
      + cname_suffix          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = (known after apply)
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = (known after apply)
      + permissions           = (known after apply)
      + plan                  = (known after apply)
      + status                = (known after apply)
      + tenant                = (known after apply)
      + tenant_unit           = (known after apply)
      + type                  = (known after apply)
      + vanity_name_servers   = (known after apply)
      + verification_key      = (known after apply)
      + zone_id               = "1263138b7d733aa1804fdc0b39c97c23"
    }

  # module.dns.aws_route53_record.api_latency["us-east-1"] will be created
  + resource "aws_route53_record" "api_latency" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.zeroverify.net"
      + records         = (known after apply)
      + set_identifier  = "us-east-1"
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0900771415X3G2Q3S52"

      + latency_routing_policy {
          + region = "us-east-1"
        }
    }

  # module.dns.aws_route53_record.api_latency["us-west-2"] will be created
  + resource "aws_route53_record" "api_latency" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.zeroverify.net"
      + records         = (known after apply)
      + set_identifier  = "us-west-2"
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0900771415X3G2Q3S52"

      + latency_routing_policy {
          + region = "us-west-2"
        }
    }

  # module.dns.cloudflare_dns_record.api_ns[0] must be replaced
-/+ resource "cloudflare_dns_record" "api_ns" {
      ~ created_on       = "2026-03-19T15:46:29Z" -> (known after apply)
      ~ id               = "7a545119d66f2e5cb8a84c42c85bc19f" -> (known after apply)
      ~ meta             = jsonencode({}) -> (known after apply)
      ~ modified_on      = "2026-03-19T15:46:29Z" -> (known after apply)
      ~ name             = "api.zeroverify.net" -> "api"
      ~ proxiable        = false -> (known after apply)
      ~ settings         = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags             = [] -> (known after apply)
      + tags_modified_on = (known after apply)
      ~ zone_id          = "1263138b7d733aa1804fdc0b39c97c23" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.dns.cloudflare_dns_record.api_ns[1] must be replaced
-/+ resource "cloudflare_dns_record" "api_ns" {
      ~ created_on       = "2026-03-19T15:46:33Z" -> (known after apply)
      ~ id               = "c9774e3ef90651e1c6c23bbbece154ac" -> (known after apply)
      ~ meta             = jsonencode({}) -> (known after apply)
      ~ modified_on      = "2026-03-19T15:46:33Z" -> (known after apply)
      ~ name             = "api.zeroverify.net" -> "api"
      ~ proxiable        = false -> (known after apply)
      ~ settings         = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags             = [] -> (known after apply)
      + tags_modified_on = (known after apply)
      ~ zone_id          = "1263138b7d733aa1804fdc0b39c97c23" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.dns.cloudflare_dns_record.api_ns[2] must be replaced
-/+ resource "cloudflare_dns_record" "api_ns" {
      ~ created_on       = "2026-03-19T15:46:29Z" -> (known after apply)
      ~ id               = "8f83c7b598d137107bd3327d73579429" -> (known after apply)
      ~ meta             = jsonencode({}) -> (known after apply)
      ~ modified_on      = "2026-03-19T15:46:29Z" -> (known after apply)
      ~ name             = "api.zeroverify.net" -> "api"
      ~ proxiable        = false -> (known after apply)
      ~ settings         = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags             = [] -> (known after apply)
      + tags_modified_on = (known after apply)
      ~ zone_id          = "1263138b7d733aa1804fdc0b39c97c23" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.dns.cloudflare_dns_record.api_ns[3] must be replaced
-/+ resource "cloudflare_dns_record" "api_ns" {
      ~ created_on       = "2026-03-19T15:46:29Z" -> (known after apply)
      ~ id               = "c4083716fa9e669cccb1db53233cfd31" -> (known after apply)
      ~ meta             = jsonencode({}) -> (known after apply)
      ~ modified_on      = "2026-03-19T15:46:29Z" -> (known after apply)
      ~ name             = "api.zeroverify.net" -> "api"
      ~ proxiable        = false -> (known after apply)
      ~ settings         = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags             = [] -> (known after apply)
      + tags_modified_on = (known after apply)
      ~ zone_id          = "1263138b7d733aa1804fdc0b39c97c23" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.dns.cloudflare_dns_record.artifacts will be created
  + resource "cloudflare_dns_record" "artifacts" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "artifacts"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 300
      + type             = "CNAME"
      + zone_id          = (known after apply)
    }

  # module.dns.cloudflare_dns_record.github_pages_challenge must be replaced
-/+ resource "cloudflare_dns_record" "github_pages_challenge" {
      ~ created_on       = "2026-03-19T15:45:56Z" -> (known after apply)
      ~ id               = "ee412ae21494d89eca2a8b71b5c3b54c" -> (known after apply)
      ~ meta             = jsonencode({}) -> (known after apply)
      ~ modified_on      = "2026-03-19T15:45:56Z" -> (known after apply)
      ~ name             = "_github-pages-challenge-zeroverify.zeroverify.net" -> "_github-pages-challenge-zeroverify"
      ~ proxiable        = false -> (known after apply)
      ~ settings         = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags             = [] -> (known after apply)
      + tags_modified_on = (known after apply)
      ~ zone_id          = "1263138b7d733aa1804fdc0b39c97c23" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.dns.cloudflare_dns_record.www must be replaced
-/+ resource "cloudflare_dns_record" "www" {
      ~ created_on       = "2026-03-19T15:45:57Z" -> (known after apply)
      ~ id               = "5f96eabb43b0feb43d6188643cc29c45" -> (known after apply)
      ~ meta             = jsonencode({}) -> (known after apply)
      ~ modified_on      = "2026-03-19T15:45:57Z" -> (known after apply)
      ~ name             = "www.zeroverify.net" -> "www"
      ~ proxiable        = true -> (known after apply)
      ~ settings         = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags             = [] -> (known after apply)
      + tags_modified_on = (known after apply)
      ~ zone_id          = "1263138b7d733aa1804fdc0b39c97c23" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.github_oidc.aws_iam_policy.artifact_upload will be created
  + resource "aws_iam_policy" "artifact_upload" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow GitHub Actions to upload circuits and other artifacts to S3"
      + id               = (known after apply)
      + name             = "GitHubActionsArtifactUpload"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all         = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
    }

  # module.github_oidc.aws_iam_role.artifact_upload will be created
  + resource "aws_iam_role" "artifact_upload" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:ZeroVerify/circuits:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::043189681060:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for artifact uploads via GitHub Actions"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ZeroVerifyGitHubActionsArtifactUpload"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all              = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.github_oidc.aws_iam_role_policy_attachment.artifact_upload_policy will be created
  + resource "aws_iam_role_policy_attachment" "artifact_upload_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ZeroVerifyGitHubActionsArtifactUpload"
    }

  # module.lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.lambda.aws_lambda_function.bitstring_updater will be updated in-place
  ~ resource "aws_lambda_function" "bitstring_updater" {
        id                             = "zeroverify-bitstring-updater"
        tags                           = {
            "ManagedBy" = "OpenTofu"
            "Project"   = "ZeroVerify"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ENVIRONMENT" = "production"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.free will be updated in-place
  ~ resource "aws_lambda_function" "free" {
        id                             = "zeroverify-free"
        tags                           = {
            "ManagedBy" = "OpenTofu"
            "Project"   = "ZeroVerify"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "BIT_INDICES_TABLE_NAME" = "zeroverify-bit-indices"
              + "CREDENTIALS_TABLE_NAME" = "zeroverify-credentials"
              + "PRIMARY_REGION"         = "us-east-1"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.issuer will be updated in-place
  ~ resource "aws_lambda_function" "issuer" {
        id                             = "zeroverify-issuer"
        tags                           = {
            "ManagedBy" = "OpenTofu"
            "Project"   = "ZeroVerify"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "BIT_INDICES_TABLE_NAME" = "zeroverify-bit-indices"
              + "CREDENTIALS_TABLE_NAME" = "zeroverify-credentials"
              + "PRIMARY_REGION"         = "us-east-1"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.issuer_replica["us-west-2"] will be created
  + resource "aws_lambda_function" "issuer_replica" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "zeroverify-issuer"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-west-2"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::043189681060:role/zeroverify-issuer-lambda"
      + runtime                        = "provided.al2023"
      + s3_bucket                      = "zeroverify-deployment-artifacts"
      + s3_key                         = "lambda/issuer-lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                       = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BIT_INDICES_TABLE_NAME" = "zeroverify-bit-indices"
              + "CREDENTIALS_TABLE_NAME" = "zeroverify-credentials"
              + "ENVIRONMENT"            = "production"
              + "PRIMARY_REGION"         = "us-east-1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda.aws_lambda_function.revocation will be updated in-place
  ~ resource "aws_lambda_function" "revocation" {
        id                             = "zeroverify-revocation"
        tags                           = {
            "ManagedBy" = "OpenTofu"
            "Project"   = "ZeroVerify"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "BIT_INDICES_TABLE_NAME" = "zeroverify-bit-indices"
              + "CREDENTIALS_TABLE_NAME" = "zeroverify-credentials"
              + "PRIMARY_REGION"         = "us-east-1"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.revocation_replica["us-west-2"] will be created
  + resource "aws_lambda_function" "revocation_replica" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "zeroverify-revocation"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-west-2"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::043189681060:role/zeroverify-revocation-lambda"
      + runtime                        = "provided.al2023"
      + s3_bucket                      = "zeroverify-deployment-artifacts"
      + s3_key                         = "lambda/revocation-lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                       = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BIT_INDICES_TABLE_NAME" = "zeroverify-bit-indices"
              + "CREDENTIALS_TABLE_NAME" = "zeroverify-credentials"
              + "ENVIRONMENT"            = "production"
              + "PRIMARY_REGION"         = "us-east-1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_roles.aws_iam_role_policy.bitstring_updater_lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "bitstring_updater_lambda" {
        id     = "zeroverify-bitstring-updater-lambda:bitstring-updater-lambda-policy"
        name   = "bitstring-updater-lambda-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:GetRecords",
                          - "dynamodb:GetShardIterator",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:ListStreams",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:043189681060:table/zeroverify-bit-indices/stream/*"
                      - Sid      = "DynamoDBStreamAccess"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                      - Sid      = "CloudWatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.storage.aws_s3_bucket.artifacts will be created
  + resource "aws_s3_bucket" "artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "zeroverify-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_namespace            = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                    = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_cors_configuration.artifacts will be created
  + resource "aws_s3_bucket_cors_configuration" "artifacts" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3600
        }
    }

  # module.storage.aws_s3_bucket_lifecycle_configuration.artifacts will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "artifacts" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-versions"
          + status = "Enabled"

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
      + rule {
          + id     = "abort-incomplete-uploads"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
            }
        }
    }

  # module.storage.aws_s3_bucket_policy.artifacts will be created
  + resource "aws_s3_bucket_policy" "artifacts" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.storage.aws_s3_bucket_public_access_block.artifacts will be created
  + resource "aws_s3_bucket_public_access_block" "artifacts" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "us-east-1"
      + restrict_public_buckets = false
    }

  # module.storage.aws_s3_bucket_versioning.artifacts will be created
  + resource "aws_s3_bucket_versioning" "artifacts" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 38 to add, 5 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

Pushed by: @antonsakhanovych